<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Connect-the-sql" data-toc-modified-id="Connect-the-sql-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Connect the sql</a></span></li><li><span><a href="#Know-your-database" data-toc-modified-id="Know-your-database-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Know your database</a></span><ul class="toc-item"><li><span><a href="#All-the-tables-in-the-database" data-toc-modified-id="All-the-tables-in-the-database-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>All the tables in the database</a></span></li><li><span><a href="#Example-Table:--columns,-datatypes,-and-first-value" data-toc-modified-id="Example-Table:--columns,-datatypes,-and-first-value-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Example Table:  columns, datatypes, and first value</a></span></li><li><span><a href="#Example-Table:--columns,-datatypes,-and-first-value" data-toc-modified-id="Example-Table:--columns,-datatypes,-and-first-value-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Example Table:  columns, datatypes, and first value</a></span></li><li><span><a href="#Example-Table:--columns,-datatypes,-and-first-value" data-toc-modified-id="Example-Table:--columns,-datatypes,-and-first-value-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Example Table:  columns, datatypes, and first value</a></span></li></ul></li><li><span><a href="#Create-pandas-dataframes" data-toc-modified-id="Create-pandas-dataframes-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Create pandas dataframes</a></span></li><li><span><a href="#Pandas-dataframes-datatypes" data-toc-modified-id="Pandas-dataframes-datatypes-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Pandas dataframes datatypes</a></span></li><li><span><a href="#Create-pandas-dataframe-of-all-tables-and-all-columns" data-toc-modified-id="Create-pandas-dataframe-of-all-tables-and-all-columns-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Create pandas dataframe of all tables and all columns</a></span></li><li><span><a href="#Questions" data-toc-modified-id="Questions-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Questions</a></span><ul class="toc-item"><li><span><a href="#qn1" data-toc-modified-id="qn1-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>qn1</a></span></li><li><span><a href="#qn2" data-toc-modified-id="qn2-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>qn2</a></span></li><li><span><a href="#qn3" data-toc-modified-id="qn3-6.3"><span class="toc-item-num">6.3&nbsp;&nbsp;</span>qn3</a></span></li><li><span><a href="#qn4" data-toc-modified-id="qn4-6.4"><span class="toc-item-num">6.4&nbsp;&nbsp;</span>qn4</a></span></li><li><span><a href="#qn5" data-toc-modified-id="qn5-6.5"><span class="toc-item-num">6.5&nbsp;&nbsp;</span>qn5</a></span></li><li><span><a href="#qn6" data-toc-modified-id="qn6-6.6"><span class="toc-item-num">6.6&nbsp;&nbsp;</span>qn6</a></span></li><li><span><a href="#qn-7" data-toc-modified-id="qn-7-6.7"><span class="toc-item-num">6.7&nbsp;&nbsp;</span>qn 7</a></span></li><li><span><a href="#qn-8" data-toc-modified-id="qn-8-6.8"><span class="toc-item-num">6.8&nbsp;&nbsp;</span>qn 8</a></span></li><li><span><a href="#qn-9" data-toc-modified-id="qn-9-6.9"><span class="toc-item-num">6.9&nbsp;&nbsp;</span>qn 9</a></span></li><li><span><a href="#qn-10" data-toc-modified-id="qn-10-6.10"><span class="toc-item-num">6.10&nbsp;&nbsp;</span>qn 10</a></span></li><li><span><a href="#qn-11" data-toc-modified-id="qn-11-6.11"><span class="toc-item-num">6.11&nbsp;&nbsp;</span>qn 11</a></span></li><li><span><a href="#qn-12" data-toc-modified-id="qn-12-6.12"><span class="toc-item-num">6.12&nbsp;&nbsp;</span>qn 12</a></span></li><li><span><a href="#qn-13" data-toc-modified-id="qn-13-6.13"><span class="toc-item-num">6.13&nbsp;&nbsp;</span>qn 13</a></span></li><li><span><a href="#qn-14" data-toc-modified-id="qn-14-6.14"><span class="toc-item-num">6.14&nbsp;&nbsp;</span>qn 14</a></span></li><li><span><a href="#qn-15" data-toc-modified-id="qn-15-6.15"><span class="toc-item-num">6.15&nbsp;&nbsp;</span>qn 15</a></span></li></ul></li></ul></div>

# Connect the sql
First create a database caled cd, which has three tables cd.facilites, 
cd.bookings, and cd.memebers.


- Get data from github and put in ~/Datasets/SQL/cd/no_unzip_exercises
- Open your pdAdmin and to the browser server link
- Go to Servers, choose your postgres version, create new database called cd
- In the cd database, right click and restore data from data path `~/Datasets/SQL/cd/no_unzip_exercises`
  (I need to show all the files, this is initially hidden)
- It gives some error, but ignore it, all is well.
- Refresh the databse cd.
- Open Query tool for database cd
- `select * from cd.facilities limit 5;` hit F5 or click Flash button,
  it should give the results.
- Also, when there should be column names for given tables such as: 
  `cd > Tables > bookings > Columns > bookid, facid etc`
  
- Now we have created a postgres database called `cd`, we can use any tools to 
  access it and do the manipulations.
  
  To know the user and other credentials of postgres database, run following
  commands in pgAdmin Query Tool:
  ```sql
select user  -- gives username eg postgres
select current_database()  -- gives database name e.g dvdrental or cd 
select  inet_server_port( ); -- port number is usually 5432
  ```
  
NOTE: In pgAdmin, the server displayed is like this:
```
cd/postgres@PostgreSQL10
```

Right click properties gives:
```
database: cd
owner: postgres
```
  
We can save these credentials in local machine as a yaml file and access 
from jupyter notebook.

In [1]:
import numpy as np
import pandas as pd
import os
import yaml

with open( os.path.expanduser('~') + "/.postgres_conf.yml", 'r') as stream:
    try:
        yaml_dict = yaml.safe_load(stream)
    except yaml.YAMLError as exc:
        print(exc)

pw = yaml_dict['password']
port = yaml_dict['port']

%load_ext sql

%sql postgres://postgres:$pw@localhost:$port/cd

'Connected: postgres@cd'

# Know your database

## All the tables in the database

In [2]:
%%sql
SELECT TABLE_NAME
FROM INFORMATION_SCHEMA.TABLES
WHERE TABLE_TYPE = 'BASE TABLE'
AND TABLE_CATALOG='cd'
and TABLE_NAME  not like 'pg_%'
and TABLE_NAME  not like 'sql_%'

 * postgres://postgres:***@localhost:5432/cd
3 rows affected.

[('facilities',), ('bookings',), ('members',)]

## Example Table:  columns, datatypes, and first value

In [3]:
%%sql
select column_name, data_type, character_maximum_length
    from INFORMATION_SCHEMA.COLUMNS 
    where table_name = 'facilities';

 * postgres://postgres:***@localhost:5432/cd
6 rows affected.

[('facid', 'integer', None),
 ('name', 'character varying', 100),
 ('membercost', 'numeric', None),
 ('guestcost', 'numeric', None),
 ('initialoutlay', 'numeric', None),
 ('monthlymaintenance', 'numeric', None)]

In [4]:
%%sql
select * from cd.facilities limit 5;

 * postgres://postgres:***@localhost:5432/cd
5 rows affected.

[(0, 'Tennis Court 1', Decimal('5'), Decimal('25'), Decimal('10000'), Decimal('200')),
 (1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (2, 'Badminton Court', Decimal('0'), Decimal('15.5'), Decimal('4000'), Decimal('50')),
 (3, 'Table Tennis', Decimal('0'), Decimal('5'), Decimal('320'), Decimal('10')),
 (4, 'Massage Room 1', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000'))]

## Example Table:  columns, datatypes, and first value

In [5]:
%%sql
select column_name, data_type, character_maximum_length
    from INFORMATION_SCHEMA.COLUMNS 
    where table_name = 'bookings';

 * postgres://postgres:***@localhost:5432/cd
5 rows affected.

[('bookid', 'integer', None),
 ('facid', 'integer', None),
 ('memid', 'integer', None),
 ('starttime', 'timestamp without time zone', None),
 ('slots', 'integer', None)]

In [6]:
%%sql
select * from cd.bookings limit 2;

 * postgres://postgres:***@localhost:5432/cd
2 rows affected.

[(0, 3, 1, datetime.datetime(2012, 7, 3, 11, 0), 2),
 (1, 4, 1, datetime.datetime(2012, 7, 3, 8, 0), 2)]

## Example Table:  columns, datatypes, and first value

In [7]:
%%sql
select column_name, data_type, character_maximum_length
    from INFORMATION_SCHEMA.COLUMNS 
    where table_name = 'members';

 * postgres://postgres:***@localhost:5432/cd
8 rows affected.

[('memid', 'integer', None),
 ('surname', 'character varying', 200),
 ('firstname', 'character varying', 200),
 ('address', 'character varying', 300),
 ('zipcode', 'integer', None),
 ('telephone', 'character varying', 20),
 ('recommendedby', 'integer', None),
 ('joindate', 'timestamp without time zone', None)]

In [8]:
%%sql
select * from cd.members limit 5;

 * postgres://postgres:***@localhost:5432/cd
5 rows affected.

[(0, 'GUEST', 'GUEST', 'GUEST', 0, '(000) 000-0000', None, datetime.datetime(2012, 7, 1, 0, 0)),
 (1, 'Smith', 'Darren', '8 Bloomsbury Close, Boston', 4321, '555-555-5555', None, datetime.datetime(2012, 7, 2, 12, 2, 5)),
 (2, 'Smith', 'Tracy', '8 Bloomsbury Close, New York', 4321, '555-555-5555', None, datetime.datetime(2012, 7, 2, 12, 8, 23)),
 (3, 'Rownam', 'Tim', '23 Highway Way, Boston', 23423, '(844) 693-0723', None, datetime.datetime(2012, 7, 3, 9, 32, 15)),
 (4, 'Joplette', 'Janice', '20 Crossing Road, New York', 234, '(833) 942-4710', 1, datetime.datetime(2012, 7, 3, 10, 25, 5))]

# Create pandas dataframes

In [9]:
facilities = %sql select * from cd.facilities;
facilities = facilities.DataFrame()
facilities.head()

 * postgres://postgres:***@localhost:5432/cd
9 rows affected.

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5,25,10000,200
1,1,Tennis Court 2,5,25,8000,200
2,2,Badminton Court,0,15.5,4000,50
3,3,Table Tennis,0,5,320,10
4,4,Massage Room 1,35,80,4000,3000

In [10]:
bookings = %sql select * from cd.bookings;
bookings = bookings.DataFrame()
bookings.head()

 * postgres://postgres:***@localhost:5432/cd
4043 rows affected.

   bookid  facid  memid           starttime  slots
0       0      3      1 2012-07-03 11:00:00      2
1       1      4      1 2012-07-03 08:00:00      2
2       2      6      0 2012-07-03 18:00:00      2
3       3      7      1 2012-07-03 19:00:00      2
4       4      8      1 2012-07-03 10:00:00      1

In [11]:
members = %sql select * from cd.members;
members = members.DataFrame()
members.head()

 * postgres://postgres:***@localhost:5432/cd
31 rows affected.

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,NaN,2012-07-01 00:00:00
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,NaN,2012-07-02 12:02:05
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,NaN,2012-07-02 12:08:23
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,NaN,2012-07-03 09:32:15
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1.0,2012-07-03 10:25:05

# Pandas dataframes datatypes

In [12]:
tables = ['facilities', 'bookings', 'members']
df_tables = [facilities, bookings, members]

In [13]:
def show_first_value_and_dtype(num):
    df_tables_dtypes = [df_tables[i].dtypes.to_frame()
                        for i in range(len(df_tables)) ]
    df_tables_first_value = [df_tables[i].head(1).T
                             for i in range(len(df_tables)) ]

    display(pd.concat([df_tables_first_value[num], df_tables_dtypes[num]],
                      axis=1, sort=True,ignore_index=True)
     .rename(columns={0: 'value', 1: 'dtype'})
     .style.apply(lambda x: ['background: lightblue' 
                             if x['dtype'] == 'object'
                             else ''
                             for _ in x],axis=1)
            .set_caption('Dataframe name: ' + tables[num])
    )

In [14]:
show_first_value_and_dtype(2)

In [15]:
facilities['guestcost'] = pd.to_numeric(facilities.guestcost, errors='coerce')
facilities.initialoutlay = pd.to_numeric(facilities.initialoutlay, errors='coerce')
facilities.membercost = pd.to_numeric(facilities.membercost, errors='coerce')
facilities.monthlymaintenance = pd.to_numeric(facilities.monthlymaintenance, errors='coerce')

# Create pandas dataframe of all tables and all columns

In [16]:
all_columns = [df.columns.tolist() for df in df_tables]
df_tables_cols = pd.DataFrame(all_columns).T.fillna('')
df_tables_cols.columns = tables

In [17]:
# find repeated column names
repeated_cols = (pd.Series([i for sub in all_columns for i in sub])
                 .value_counts()
                 .loc[lambda x: x>1]
                 .index.values.tolist()
                )


cells = repeated_cols
colors = ['salmon', 'khaki','rosybrown','tomato',
          'olive', 'gray',  'mediumpurple',
          'orchid',  'plum','lavender', 'lightgreen',
          'lightsteelblue', 
          'lightblue','skyblue','orange','orangered'][:len(cells)]
cell_colors = dict(zip(cells,colors))
df_tables_cols.style.apply(lambda x: ["background: %s" % cell_colors[v] 
                          if  v in cell_colors.keys()
                          else "" for v in x], axis = 1)

# Questions
These questions start off really basic and then get continually more difficult:

1. How can you retrieve all the information from the cd.facilities table?
1. You want to print out a list of all of the facilities and their cost to members. 
- How would you retrieve a list of only facility names and costs?
1. How can you produce a list of facilities that charge a fee to members?
- How can you produce a list of facilities that charge a fee to members, and that fee is less than 1/50th of the monthly maintenance cost? Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.
- How can you produce a list of all facilities with the word 'Tennis' in their name?
- How can you retrieve the details of facilities with ID 1 and 5? Try to do it without using the OR operator.
- How can you produce a list of members who joined after the start of September 2012? Return the memid, surname, firstname, and joindate of the members in question.
- How can you produce an ordered list of the first 10 surnames in the members table? The list must not contain duplicates.
- You'd like to get the signup date of your last member. How can you retrieve this information?
- Produce a count of the number of facilities that have a cost to guests of 10 or more.
Skip this one, no question for #11.
- Produce a list of the total number of slots booked per facility in the month of September 2012. Produce an output table consisting of facility id and slots, sorted by the number of slots.
- Produce a list of facilities with more than 1000 slots booked. Produce an output table consisting of facility id and total slots, sorted by facility id.
- How can you produce a list of the start times for bookings for tennis courts, for the date '2012-09-21'? Return a list of start time and facility name pairings, ordered by the time.
- How can you produce a list of the start times for bookings by members named 'David Farrell'?

## qn1
> How can you retrieve all the information from the cd.facilities table?

In [18]:
%%sql
select * from cd.facilities;

 * postgres://postgres:***@localhost:5432/cd
9 rows affected.

[(0, 'Tennis Court 1', Decimal('5'), Decimal('25'), Decimal('10000'), Decimal('200')),
 (1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (2, 'Badminton Court', Decimal('0'), Decimal('15.5'), Decimal('4000'), Decimal('50')),
 (3, 'Table Tennis', Decimal('0'), Decimal('5'), Decimal('320'), Decimal('10')),
 (4, 'Massage Room 1', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000')),
 (5, 'Massage Room 2', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000')),
 (6, 'Squash Court', Decimal('3.5'), Decimal('17.5'), Decimal('5000'), Decimal('80')),
 (7, 'Snooker Table', Decimal('0'), Decimal('5'), Decimal('450'), Decimal('15')),
 (8, 'Pool Table', Decimal('0'), Decimal('5'), Decimal('400'), Decimal('15'))]

In [19]:
facilities

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000.0,200.0
1,1,Tennis Court 2,5.0,25.0,8000.0,200.0
2,2,Badminton Court,0.0,15.5,4000.0,50.0
3,3,Table Tennis,0.0,5.0,320.0,10.0
4,4,Massage Room 1,35.0,80.0,4000.0,3000.0
5,5,Massage Room 2,35.0,80.0,4000.0,3000.0
6,6,Squash Court,3.5,17.5,5000.0,80.0
7,7,Snooker Table,0.0,5.0,450.0,15.0
8,8,Pool Table,0.0,5.0,400.0,15.0

## qn2
> You want to print out a list of all of the facilities and their cost to members. How would you retrieve a list of only facility names and costs?

In [20]:
%%sql
select name, membercost from cd.facilities;

 * postgres://postgres:***@localhost:5432/cd
9 rows affected.

[('Tennis Court 1', Decimal('5')),
 ('Tennis Court 2', Decimal('5')),
 ('Badminton Court', Decimal('0')),
 ('Table Tennis', Decimal('0')),
 ('Massage Room 1', Decimal('35')),
 ('Massage Room 2', Decimal('35')),
 ('Squash Court', Decimal('3.5')),
 ('Snooker Table', Decimal('0')),
 ('Pool Table', Decimal('0'))]

In [21]:
facilities[['name','membercost']]

              name  membercost
0   Tennis Court 1         5.0
1   Tennis Court 2         5.0
2  Badminton Court         0.0
3     Table Tennis         0.0
4   Massage Room 1        35.0
5   Massage Room 2        35.0
6     Squash Court         3.5
7    Snooker Table         0.0
8       Pool Table         0.0

## qn3
> How can you produce a list of facilities that charge a fee to members?

In [22]:
%%sql
select * from cd.facilities
where membercost > 0.0;

 * postgres://postgres:***@localhost:5432/cd
5 rows affected.

[(0, 'Tennis Court 1', Decimal('5'), Decimal('25'), Decimal('10000'), Decimal('200')),
 (1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (4, 'Massage Room 1', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000')),
 (5, 'Massage Room 2', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000')),
 (6, 'Squash Court', Decimal('3.5'), Decimal('17.5'), Decimal('5000'), Decimal('80'))]

In [23]:
facilities[facilities.membercost > 0.0]

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000.0,200.0
1,1,Tennis Court 2,5.0,25.0,8000.0,200.0
4,4,Massage Room 1,35.0,80.0,4000.0,3000.0
5,5,Massage Room 2,35.0,80.0,4000.0,3000.0
6,6,Squash Court,3.5,17.5,5000.0,80.0

## qn4
> How can you produce a list of facilities that charge a fee to members, and that fee is less than 1/50th of the monthly maintenance cost? Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

In [24]:
%%sql
select facid, name, membercost, monthlymaintenance, membercost*50 as membercost_50
from cd.facilities
where membercost > 0.0
  and membercost < (monthlymaintenance/50)
;

 * postgres://postgres:***@localhost:5432/cd
2 rows affected.

[(4, 'Massage Room 1', Decimal('35'), Decimal('3000'), Decimal('1750')),
 (5, 'Massage Room 2', Decimal('35'), Decimal('3000'), Decimal('1750'))]

In [25]:
(facilities[['facid', 'name', 'membercost', 'monthlymaintenance']]
 .loc[lambda x: (x.membercost > 0) & (x.membercost < x.monthlymaintenance/50)]
)

   facid            name  membercost  monthlymaintenance
4      4  Massage Room 1        35.0              3000.0
5      5  Massage Room 2        35.0              3000.0

## qn5
> How can you produce a list of all facilities with the word 'Tennis' in their name?

In [26]:
%%sql
select * from cd.facilities
where name like '%Tennis%';

 * postgres://postgres:***@localhost:5432/cd
3 rows affected.

[(0, 'Tennis Court 1', Decimal('5'), Decimal('25'), Decimal('10000'), Decimal('200')),
 (1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (3, 'Table Tennis', Decimal('0'), Decimal('5'), Decimal('320'), Decimal('10'))]

In [27]:
%%sql
select * from cd.facilities
where lower(name) like '%tennis%';

 * postgres://postgres:***@localhost:5432/cd
3 rows affected.

[(0, 'Tennis Court 1', Decimal('5'), Decimal('25'), Decimal('10000'), Decimal('200')),
 (1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (3, 'Table Tennis', Decimal('0'), Decimal('5'), Decimal('320'), Decimal('10'))]

In [28]:
%%sql
select * from cd.facilities
where name ilike '%tennis%';

 * postgres://postgres:***@localhost:5432/cd
3 rows affected.

[(0, 'Tennis Court 1', Decimal('5'), Decimal('25'), Decimal('10000'), Decimal('200')),
 (1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (3, 'Table Tennis', Decimal('0'), Decimal('5'), Decimal('320'), Decimal('10'))]

In [29]:
facilities[facilities['name'].str.contains('Tennis')]

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000.0,200.0
1,1,Tennis Court 2,5.0,25.0,8000.0,200.0
3,3,Table Tennis,0.0,5.0,320.0,10.0

## qn6
> How can you retrieve the details of facilities with ID 1 and 5? Try to do it without using the OR operator.

In [30]:
%%sql
select * from cd.facilities
where facid in (1,5);

 * postgres://postgres:***@localhost:5432/cd
2 rows affected.

[(1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (5, 'Massage Room 2', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000'))]

In [31]:
%%sql
select * from cd.facilities
where facid = 1 or facid = 5;

 * postgres://postgres:***@localhost:5432/cd
2 rows affected.

[(1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (5, 'Massage Room 2', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000'))]

In [32]:
facilities[facilities['facid'].isin([1,5])]

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
1,1,Tennis Court 2,5.0,25.0,8000.0,200.0
5,5,Massage Room 2,35.0,80.0,4000.0,3000.0

## qn 7
> How can you produce a list of members who joined after the start of September 2012? Return the memid, surname, firstname, and joindate of the members in question.

In [33]:
%%sql
select memid, surname, firstname, joindate  from cd.members
where joindate >=  '2012-09-01'
;

 * postgres://postgres:***@localhost:5432/cd
10 rows affected.

[(24, 'Sarwin', 'Ramnaresh', datetime.datetime(2012, 9, 1, 8, 44, 42)),
 (26, 'Jones', 'Douglas', datetime.datetime(2012, 9, 2, 18, 43, 5)),
 (27, 'Rumney', 'Henrietta', datetime.datetime(2012, 9, 5, 8, 42, 35)),
 (28, 'Farrell', 'David', datetime.datetime(2012, 9, 15, 8, 22, 5)),
 (29, 'Worthington-Smyth', 'Henry', datetime.datetime(2012, 9, 17, 12, 27, 15)),
 (30, 'Purview', 'Millicent', datetime.datetime(2012, 9, 18, 19, 4, 1)),
 (33, 'Tupperware', 'Hyacinth', datetime.datetime(2012, 9, 18, 19, 32, 5)),
 (35, 'Hunt', 'John', datetime.datetime(2012, 9, 19, 11, 32, 45)),
 (36, 'Crumpet', 'Erica', datetime.datetime(2012, 9, 22, 8, 36, 38)),
 (37, 'Smith', 'Darren', datetime.datetime(2012, 9, 26, 18, 8, 45))]

In [34]:
(members[['memid', 'surname', 'firstname', 'joindate']]
 .loc[lambda x: x.joindate > '2012 september']
)

    memid            surname  firstname            joindate
21     24             Sarwin  Ramnaresh 2012-09-01 08:44:42
22     26              Jones    Douglas 2012-09-02 18:43:05
23     27             Rumney  Henrietta 2012-09-05 08:42:35
24     28            Farrell      David 2012-09-15 08:22:05
25     29  Worthington-Smyth      Henry 2012-09-17 12:27:15
26     30            Purview  Millicent 2012-09-18 19:04:01
27     33         Tupperware   Hyacinth 2012-09-18 19:32:05
28     35               Hunt       John 2012-09-19 11:32:45
29     36            Crumpet      Erica 2012-09-22 08:36:38
30     37              Smith     Darren 2012-09-26 18:08:45

## qn 8
> How can you produce an ordered list of the first 10 surnames in the members table? The list must not contain duplicates.

In [35]:
%%sql
select distinct(surname)
from cd.members
order by surname
limit 10;

 * postgres://postgres:***@localhost:5432/cd
10 rows affected.

[('Bader',),
 ('Baker',),
 ('Boothe',),
 ('Butters',),
 ('Coplin',),
 ('Crumpet',),
 ('Dare',),
 ('Farrell',),
 ('GUEST',),
 ('Genting',)]

In [36]:
members.surname.drop_duplicates().sort_values().head(10)

15      Bader
12      Baker
8      Boothe
5     Butters
20     Coplin
29    Crumpet
7        Dare
13    Farrell
0       GUEST
18    Genting
Name: surname, dtype: object

## qn 9
> You'd like to get the signup date of your last member. How can you retrieve this information?

In [37]:
%%sql
select max(joindate) as last_joindate from cd.members;

 * postgres://postgres:***@localhost:5432/cd
1 rows affected.

[(datetime.datetime(2012, 9, 26, 18, 8, 45),)]

In [38]:
%%sql
select joindate from cd.members
order by joindate desc
limit 1
;

 * postgres://postgres:***@localhost:5432/cd
1 rows affected.

[(datetime.datetime(2012, 9, 26, 18, 8, 45),)]

In [39]:
members.joindate.max()

Timestamp('2012-09-26 18:08:45')

## qn 10
> Produce a count of the number of facilities that have a cost to guests of 10 or more.

In [40]:
%%sql
select count(*) from cd.facilities
where guestcost >= 10
;

 * postgres://postgres:***@localhost:5432/cd
1 rows affected.

[(6,)]

In [41]:
%%sql -- just look at this
select * from cd.facilities
order by guestcost;

 * postgres://postgres:***@localhost:5432/cd
9 rows affected.

[(7, 'Snooker Table', Decimal('0'), Decimal('5'), Decimal('450'), Decimal('15')),
 (3, 'Table Tennis', Decimal('0'), Decimal('5'), Decimal('320'), Decimal('10')),
 (8, 'Pool Table', Decimal('0'), Decimal('5'), Decimal('400'), Decimal('15')),
 (2, 'Badminton Court', Decimal('0'), Decimal('15.5'), Decimal('4000'), Decimal('50')),
 (6, 'Squash Court', Decimal('3.5'), Decimal('17.5'), Decimal('5000'), Decimal('80')),
 (0, 'Tennis Court 1', Decimal('5'), Decimal('25'), Decimal('10000'), Decimal('200')),
 (1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (5, 'Massage Room 2', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000')),
 (4, 'Massage Room 1', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000'))]

In [42]:
facilities.guestcost[facilities.guestcost>10].count()

6

## qn 11
> Skip this one, no question for #11.

## qn 12
> Produce a list of the total number of slots booked per facility in the month of September 2012. Produce an output table consisting of facility id and slots, sorted by the number of slots.

In [43]:
%%sql
select  facid, sum(slots) as total_slots from cd.bookings
where starttime between '2012-09-01' and '2012-09-30'
group by facid
order by sum(slots);

 * postgres://postgres:***@localhost:5432/cd
9 rows affected.

[(5, 118),
 (3, 410),
 (7, 412),
 (8, 453),
 (6, 522),
 (2, 546),
 (0, 567),
 (1, 567),
 (4, 628)]

In [44]:
%%sql
select  facid, sum(slots) as count_slots from cd.bookings
where extract(month from starttime) = 9 and extract(year from starttime) = 2012
group by facid
order by sum(slots)
;

 * postgres://postgres:***@localhost:5432/cd
9 rows affected.

[(5, 122),
 (3, 422),
 (7, 426),
 (8, 471),
 (6, 540),
 (2, 570),
 (1, 588),
 (0, 591),
 (4, 648)]

In [45]:
%%sql
select  facid, sum(slots) as total_slots from cd.bookings
where starttime >= '2012-09-01' and starttime < '2012-09-30'
group by facid
order by sum(slots);

 * postgres://postgres:***@localhost:5432/cd
9 rows affected.

[(5, 118),
 (3, 410),
 (7, 412),
 (8, 453),
 (6, 522),
 (2, 546),
 (0, 567),
 (1, 567),
 (4, 628)]

## qn 13
> Produce a list of facilities with more than 1000 slots booked. 
Produce an output table consisting of facility id and total slots,
sorted by facility id.

In [46]:
%%sql --look at tables
select * from cd.bookings limit 2;

 * postgres://postgres:***@localhost:5432/cd
2 rows affected.

[(0, 3, 1, datetime.datetime(2012, 7, 3, 11, 0), 2),
 (1, 4, 1, datetime.datetime(2012, 7, 3, 8, 0), 2)]

In [47]:
%%sql --look at distinct facility ids.
select distinct(facid) from cd.bookings;

 * postgres://postgres:***@localhost:5432/cd
9 rows affected.

[(8,), (7,), (1,), (5,), (2,), (4,), (0,), (6,), (3,)]

In [48]:
%%sql
select facid, sum(slots) as total_slots
from cd.bookings
group by facid
having sum(slots) > 1000
order by facid;

 * postgres://postgres:***@localhost:5432/cd
5 rows affected.

[(0, 1320), (1, 1278), (2, 1209), (4, 1404), (6, 1104)]

In [49]:
(bookings[['facid','slots']]
 .groupby(['facid'])['slots']
 .sum()
 .loc[lambda x: x > 1000]
 .sort_index()
 .reset_index()
)

   facid  slots
0      0   1320
1      1   1278
2      2   1209
3      4   1404
4      6   1104

## qn 14
> How can you produce a list of the start times for bookings for tennis courts,
for the date '2012-09-21'?
Return a list of start time and facility name pairings, ordered by the time.

In [50]:
%%sql --look at table
select * from cd.bookings limit 2;

 * postgres://postgres:***@localhost:5432/cd
2 rows affected.

[(0, 3, 1, datetime.datetime(2012, 7, 3, 11, 0), 2),
 (1, 4, 1, datetime.datetime(2012, 7, 3, 8, 0), 2)]

In [51]:
%%sql --look at table
select * from cd.facilities limit 2;

 * postgres://postgres:***@localhost:5432/cd
2 rows affected.

[(0, 'Tennis Court 1', Decimal('5'), Decimal('25'), Decimal('10000'), Decimal('200')),
 (1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200'))]

In [52]:
%%sql
select b.facid, f.name, b.starttime
from cd.bookings as b
inner join cd.facilities as f
on b.facid = f.facid
where to_char(b.starttime, 'YYYY-MM-DD')  = '2012-09-21'
order by b.starttime -- 69 rows given
limit 5;

 * postgres://postgres:***@localhost:5432/cd
5 rows affected.

[(0, 'Tennis Court 1', datetime.datetime(2012, 9, 21, 8, 0)),
 (1, 'Tennis Court 2', datetime.datetime(2012, 9, 21, 8, 0)),
 (4, 'Massage Room 1', datetime.datetime(2012, 9, 21, 8, 30)),
 (7, 'Snooker Table', datetime.datetime(2012, 9, 21, 8, 30)),
 (8, 'Pool Table', datetime.datetime(2012, 9, 21, 8, 30))]

In [53]:
%%sql
select b.facid, f.name, b.starttime
from cd.bookings as b
inner join cd.facilities as f
on b.facid = f.facid
where extract( year from b.starttime) = 2012 
    and extract( month from b.starttime) = 9
    and extract( day from b.starttime) = 21
order by b.starttime --69 rows are given
limit 5;

 * postgres://postgres:***@localhost:5432/cd
5 rows affected.

[(1, 'Tennis Court 2', datetime.datetime(2012, 9, 21, 8, 0)),
 (0, 'Tennis Court 1', datetime.datetime(2012, 9, 21, 8, 0)),
 (7, 'Snooker Table', datetime.datetime(2012, 9, 21, 8, 30)),
 (4, 'Massage Room 1', datetime.datetime(2012, 9, 21, 8, 30)),
 (8, 'Pool Table', datetime.datetime(2012, 9, 21, 8, 30))]

In [54]:
%%sql
select b.facid, f.name, b.starttime
from cd.bookings as b
inner join cd.facilities as f
on b.facid = f.facid
where  b.starttime between '2012-09-21' and '2012-09-22'
order by b.starttime -- 69 rows given
limit 5;

 * postgres://postgres:***@localhost:5432/cd
5 rows affected.

[(0, 'Tennis Court 1', datetime.datetime(2012, 9, 21, 8, 0)),
 (1, 'Tennis Court 2', datetime.datetime(2012, 9, 21, 8, 0)),
 (4, 'Massage Room 1', datetime.datetime(2012, 9, 21, 8, 30)),
 (7, 'Snooker Table', datetime.datetime(2012, 9, 21, 8, 30)),
 (8, 'Pool Table', datetime.datetime(2012, 9, 21, 8, 30))]

In [55]:
%%sql
select b.starttime as start, f.name as name 
from cd.facilities f
inner join cd.bookings b 
on f.facid = b.facid 
where f.facid in (0,1) 
  and b.starttime >= '2012-09-21' 
  and b.starttime < '2012-09-22'

order by b.starttime;

 * postgres://postgres:***@localhost:5432/cd
12 rows affected.

[(datetime.datetime(2012, 9, 21, 8, 0), 'Tennis Court 1'),
 (datetime.datetime(2012, 9, 21, 8, 0), 'Tennis Court 2'),
 (datetime.datetime(2012, 9, 21, 9, 30), 'Tennis Court 1'),
 (datetime.datetime(2012, 9, 21, 10, 0), 'Tennis Court 2'),
 (datetime.datetime(2012, 9, 21, 11, 30), 'Tennis Court 2'),
 (datetime.datetime(2012, 9, 21, 12, 0), 'Tennis Court 1'),
 (datetime.datetime(2012, 9, 21, 13, 30), 'Tennis Court 1'),
 (datetime.datetime(2012, 9, 21, 14, 0), 'Tennis Court 2'),
 (datetime.datetime(2012, 9, 21, 15, 30), 'Tennis Court 1'),
 (datetime.datetime(2012, 9, 21, 16, 0), 'Tennis Court 2'),
 (datetime.datetime(2012, 9, 21, 17, 0), 'Tennis Court 1'),
 (datetime.datetime(2012, 9, 21, 18, 0), 'Tennis Court 2')]

In [56]:
df_tables_cols

           facilities   bookings        members
0               facid     bookid          memid
1                name      facid        surname
2          membercost      memid      firstname
3           guestcost  starttime        address
4       initialoutlay      slots        zipcode
5  monthlymaintenance                 telephone
6                                 recommendedby
7                                      joindate

In [57]:
(pd.merge(bookings[['facid','starttime']]
            .loc[lambda x: x.starttime.between("2012-09-21", "2012-09-22")],
          facilities[['facid','name']], on='facid', how='inner')
.sort_values('starttime')
.head()
)

    facid           starttime            name
0       0 2012-09-21 08:00:00  Tennis Court 1
6       1 2012-09-21 08:00:00  Tennis Court 2
45      7 2012-09-21 08:30:00   Snooker Table
25      4 2012-09-21 08:30:00  Massage Room 1
53      8 2012-09-21 08:30:00      Pool Table

In [58]:
(pd.merge(bookings[['facid','starttime']]
            .query( """  '2012-09-21' < starttime <  '2012-09-22' """),
          facilities[['facid','name']], on='facid', how='inner')
.sort_values('starttime')
.head()
)

    facid           starttime            name
0       0 2012-09-21 08:00:00  Tennis Court 1
6       1 2012-09-21 08:00:00  Tennis Court 2
45      7 2012-09-21 08:30:00   Snooker Table
25      4 2012-09-21 08:30:00  Massage Room 1
53      8 2012-09-21 08:30:00      Pool Table

## qn 15
> How can you produce a list of the start times for bookings by members named 'David Farrell'?

In [59]:
%%sql
select * from cd.bookings limit 2;

 * postgres://postgres:***@localhost:5432/cd
2 rows affected.

[(0, 3, 1, datetime.datetime(2012, 7, 3, 11, 0), 2),
 (1, 4, 1, datetime.datetime(2012, 7, 3, 8, 0), 2)]

In [60]:
%%sql
select * from cd.members limit 2;

 * postgres://postgres:***@localhost:5432/cd
2 rows affected.

[(0, 'GUEST', 'GUEST', 'GUEST', 0, '(000) 000-0000', None, datetime.datetime(2012, 7, 1, 0, 0)),
 (1, 'Smith', 'Darren', '8 Bloomsbury Close, Boston', 4321, '555-555-5555', None, datetime.datetime(2012, 7, 2, 12, 2, 5))]

In [61]:
%%sql
select b.memid, b.starttime, m.firstname, m.surname, m.firstname || ' ' || m.surname as full_name
from cd.members as m
inner join cd.bookings as b
    on m.memid = b.memid
    where m.firstname = 'David' and m.surname = 'Farrell'
limit 5;

 * postgres://postgres:***@localhost:5432/cd
5 rows affected.

[(28, datetime.datetime(2012, 9, 18, 9, 0), 'David', 'Farrell', 'David Farrell'),
 (28, datetime.datetime(2012, 9, 18, 13, 30), 'David', 'Farrell', 'David Farrell'),
 (28, datetime.datetime(2012, 9, 18, 17, 30), 'David', 'Farrell', 'David Farrell'),
 (28, datetime.datetime(2012, 9, 18, 20, 0), 'David', 'Farrell', 'David Farrell'),
 (28, datetime.datetime(2012, 9, 19, 9, 30), 'David', 'Farrell', 'David Farrell')]

In [62]:
%%sql
select b.starttime 
from cd.bookings b 
inner join cd.members m
on m.memid = b.memid 
where m.firstname='David' and m.surname='Farrell'
limit 5;

 * postgres://postgres:***@localhost:5432/cd
5 rows affected.

[(datetime.datetime(2012, 9, 18, 9, 0),),
 (datetime.datetime(2012, 9, 18, 13, 30),),
 (datetime.datetime(2012, 9, 18, 17, 30),),
 (datetime.datetime(2012, 9, 18, 20, 0),),
 (datetime.datetime(2012, 9, 19, 9, 30),)]

In [63]:
# the above query joins two tables then filter out for person
# we can use subquery to first filter out person and then join with another table.

In [64]:
%%sql
select b.memid, b.starttime, mm.firstname, mm.surname, mm.firstname || ' ' || mm.surname as full_name
from cd.bookings as b
inner join ( select * from cd.members m where m.firstname = 'David' and m.surname = 'Farrell') as mm
    on b.memid = mm.memid
    
limit 5;

 * postgres://postgres:***@localhost:5432/cd
5 rows affected.

[(28, datetime.datetime(2012, 9, 18, 9, 0), 'David', 'Farrell', 'David Farrell'),
 (28, datetime.datetime(2012, 9, 18, 13, 30), 'David', 'Farrell', 'David Farrell'),
 (28, datetime.datetime(2012, 9, 18, 17, 30), 'David', 'Farrell', 'David Farrell'),
 (28, datetime.datetime(2012, 9, 18, 20, 0), 'David', 'Farrell', 'David Farrell'),
 (28, datetime.datetime(2012, 9, 19, 9, 30), 'David', 'Farrell', 'David Farrell')]